cinema_address_map = {

    # 新光影城
    "新光影城台北獅子林" : "台北市西寧南路36號4-5F(西門町獅子林商業大樓)",
    "新光影城台北天母" : "台北市士林區忠誠路二段202號4F(新光三越百貨台北天母店B棟)",
    "新光影城桃園青埔" : "桃園市中壢區春德路107號",
    "新光影城台中中港" : "台中市臺灣大道三段301號13-14F(位於新光三越百貨台中中港店)",
    "新光影城台南西門" : "台南市西門路一段658號7~9F(位於新光三越百貨台南新天地)",

    # 威尼斯影城
    "威尼斯影城": "桃園市中壢區九和一街48號3F之2",

    # 星橋國際影城
    "星橋國際影城": "桃園市中壢區中園路二段501號5F",

    # 國賓影城
    "國賓大戲院": "台北市萬華區成都路88號",
    "台北長春國賓影城": "台北市中山區長春路176號",
    "新莊晶冠國賓影城": "新北市新莊區五工路66號3F、4F",
    "林口昕境國賓影城": "新北市林口區文化三路一段402巷2號4F",
    "淡水禮萊國賓影城": "新北市淡水區中正路一段2號",
    "八德置地國賓影城": "桃園市八德區介壽路一段728號3F",
    "八德廣豐國賓影城": "桃園市八德區介壽路一段728號3F",

    "高雄義大國賓影城": "高雄市大樹區學城路一段12號3F",
    "高雄SKM Park國賓影城": "高雄市前鎮區中山四路100號3F",
    "高雄草衙道國賓影城": "高雄市前鎮區中山四路100號3F",

    "台南國賓影城": "台南市東區中華東路一段66號",
    "屏東環球國賓影城": "屏東縣屏東市仁愛路90號(環球購物中心6F)",
    "金門昇恆昌國賓影城": "金門縣金湖鎮太湖路二段198號6F",

    # 威秀影城
    "MUVIE CINEMAS 台北松仁": "台北市信義區松仁路58號10F(遠百信義A13)",
    "MUVIE CINEMAS 台中TIGER CITY": "台中市西屯區河南路三段120-1號4F(TIGER CITY購物中心)",

    "台北信義威秀影城": "台北市信義區松壽路20號",
    "台北南港LaLaport威秀影城": "台北市南港區經貿二路131號5F(南港LaLaport購物中心)",
    "台北京站威秀影城": "台北市大同區市民大道一段209號5F(Q square京站時尚廣場)",
    "台北西門威秀影城": "台北市萬華區漢中街52號8-11F",
    "新店裕隆城威秀影城": "新北市新店區中興路三段70號7F(裕隆城)",
    "板橋大遠百威秀影城": "新北市板橋區新站路28號10F(Mega City 板橋大遠百)",
    "中和環球威秀影城": "新北市中和區中山路三段122號4F(Global Mall新北中和)",
    "林口MITSUI OUTLET PARK威秀影城": "新北市林口區文化三路一段356號3F(MITSUI OUTLET PARK 林口)",

    "桃園統領威秀影城": "桃園市桃園區中正路61號9F(統領廣場TONLIN PLAZA)",
    "桃園桃知道威秀影城": "桃園市桃園區南平路301號4F(桃知道GELEVEN PLAZA)",
    "新竹巨城威秀影城": "新竹市民權路176號4F之3(Big City遠東巨城購物中心)",
    "新竹大遠百威秀影城": "新竹市西大路323號8F(新竹大遠百)",
    "頭份尚順威秀影城": "苗栗縣頭份市育樂街8號7F(尚順購物中心)",

    "台中大遠百威秀影城": "台中市西屯區臺灣大道三段251號13F(Top City台中大遠百)",
    "台中大魯閣新時代威秀影城": "台中市東區復興路四段186號4F(台中大魯閣新時代購物中心)",
    "台南大遠百威秀影城": "台南市中西區公園路60號5F(台南大遠百公園店)",
    "台南FOCUS 威秀影城": "台南市中西區中山路166號11F(Focus時尚流行館)",
    "台南南紡威秀影城": "台南市東區中華東路一段366號5F",
    "高雄大遠百威秀影城": "高雄市苓雅區三多四路21號13F(高雄大遠百購物中心)",
    "花蓮新天堂樂園威秀影城": "花蓮縣吉安鄉南濱路一段503號3F(花蓮新天堂樂園購物商場)",

    # 秀泰影城
    "基隆秀泰": "基隆市信一路177號",
    "台北欣欣秀泰": "台北市中山區林森北路247號",
    "板橋秀泰": "新北市板橋區縣民大道二段3號",
    "樹林秀泰": "新北市樹林區樹新路40-6號",
    "土城秀泰": "新北市土城區學府路二段210號",
    "台中站前秀泰": "台中市東區南京路76號",
    "台中文心秀泰": "台中市南屯區文心南路289號7-8F",
    "台中麗寶秀泰": "台中市后里區月眉東路二段181號3F",
    "北港秀泰": "雲林縣北港鎮光復里華南路101號2F",
    "嘉義秀泰": "嘉義市西區文化路299號",
    "台南仁德秀泰": "台南市仁德區仁愛里大同路三段759號2F",
    "高雄岡山秀泰": "高雄市岡山區捷安路1巷2號4F",
    "高雄夢時代秀泰影城": "高雄市前鎮區中華五路789號8F",
    "花蓮秀泰": "花蓮市國聯五路69號",
    "台東秀泰": "台東市新生路93號",

}